{
    "Dragon": "A colossal, ancient dragon with molten-metal scales and eyes like coals of old wars. Its wings darken the sky and its breath incinerates all before it.",
    "Death Knight": "An undead champion in blackened plate, trailing a chill of necrotic power. Its blade is honed for slaughter and its gaze bleeds courage.",
    "Archlich": "A skeletal archmage bound to undeath, wrapped in glowing runes. Its mastery of forbidden arts can rend the fabric of reality.",
    "Leviathan": "A titanic sea horror, as if the ocean itself walked the land; the air around it tastes of salt and pressure, and its bulk flattens the unwary.",
    "Hydra": "A many-headed serpent whose severed necks may spawn new heads. Keep distance—each bite and spray is coated with venom.",
    "Chimera": "A chaotic chimera with lion, goat and serpent parts; expect breath attacks, sudden changes in tactic, and savage pounces.",
    "Hell Knight": "A knight forged in infernal fire: smoldering armor, precise strikes, and an aura that scorches the boldest hearts.",
    "Wyvern": "A lithe, winged predator with a venomous stinger; it dives with terrifying speed and rips flesh with razor wings.",
    "Manticore": "A lionlike beast with a grim human face and a tail bristling with barbed spikes it launches like missiles—deadly at range or up close.",
    "Golem": "A vast construct of stone and iron animated by old magics: slow, unstoppable, and crushing in its assaults.",
    "Frost Troll": "A towering troll of ice and frost whose wounds knit back quickly; each strike leaves a scalding shard of winter in its wake.",
    "Vampire": "A predatory vampire, cloaked in shadow, with eyes like burning coals and fangs gleaming in the dark..",
    "Dark Elf": "A shadow-dwelling elf who moves like a whisper—deadly with blade and spell, and comfortable in treachery.",
    "Wraith": "A living shadow—hollow-eyed and hungry—able to slip through armor and sap the warmth from bone.",
    "Banshee": "A wailing spirit whose scream can unmake courage; its lament curdles the blood and leaves the living trembling.",
    "Shadow Fiend": "A creature born of night, preferring stealth and terror to open combat; it leaves only dread and cold footprints.",
    "Succubus": "A beguiling demoness whose charms hide poison—she wins trust before devouring will and vigor.",
    "Gargoyle": "A stone sentinel that watches from ledges until it moves—then it tears at flesh with chitin teeth and flapping wings.",
    "Minotaur": "A hulking, horned brute with bull-like fury and savage horns; its instincts make it a relentless pursuer in mazes.",
    "Troll": "A regenerative giant: crude, strong, and hard to put down unless its wounds are thoroughly destroyed.",
    "Giant Spider": "A bulky spider that weaves the corridors into traps; venomous fangs and unnerving speed make it a fearsome ambusher.",
    "Ghost": "A sorrowful spirit trapped between worlds—its touch chills life away and its presence echoes old tragedies.",
    "Werewolf": "A cursed warrior who sheds his humanity beneath the moon; feral strength and savage claws define the hunt.",
    "Hobgoblin": "A disciplined goblinoid with battlefield cunning—organized, dangerous, and more formidable than common goblins.",
    "Green Slime": "A corrosive formless ooze that eats through armor and flesh, seeping into cracks and surprising the careless.",
    "Orc": "A savage frontline fighter, brutal and loud; dangerous in numbers and fond of brawling tactics.",
    "Hellhound": "A hellish canine wreathed in embers, with burning breath and teeth that leave smoldering wounds.",
    "Ghoul": "An undead scavenger that feasts on carrion and flesh—fast, nasty, and vicious in packs.",
    "Zombie": "A shambling corpse driven by a base hunger: slow, numerous, and relentless in groups.",
    "Goblin": "A small, cunning trickster—quick with traps and ambushes rather than fair fights.",
    "Skeleton": "Clattering animated bones formed into soldiers by necromancy: fragile alone but dangerous when backed by numbers."
}